# Introduction to Pandas
You can think of pandas as an extremely powerful version of Excel, with a lot more features. In this section of the course, you should go through the notebooks in this order:

* Introduction to Pandas
* Series
* DataFrames
* Missing Data
* GroupBy
* Data Input and Output

## Series

The first main data type we will learn about for pandas is the Series data type. Let's import Pandas and explore the Series object.

A Series is very similar to a NumPy array (in fact it is built on top of the NumPy array object). What differentiates the NumPy array from a Series, is that a Series can have axis labels, meaning it can be indexed by a label, instead of just a number location. It also doesn't need to hold numeric data, it can hold any arbitrary Python Object.

Let's explore this concept through some examples:

In [ ]:
import numpy as np
import pandas as pd

### Creating a Series

You can convert a list,numpy array, or dictionary to a Series:

In [ ]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

**Using Lists**

In [ ]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [ ]:
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [ ]:
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int64

** NumPy Arrays **

In [ ]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [ ]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

**Dictionary**

In [ ]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

### Data in a Series

A pandas Series can hold a variety of object types:

In [ ]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [ ]:
# Even functions (although unlikely that you will use this)
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

## Using an Index

The key to using a Series is understanding its index. Pandas makes use of these index names or numbers by allowing for fast look ups of information (works like a hash table or dictionary).

Let's see some examples of how to grab information from a Series. Let us create two sereis, ser1 and ser2:

In [ ]:
ser1 = pd.Series([1,2,3,4],index = ['USA', 'Germany','USSR', 'Japan'])

In [ ]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [ ]:
ser2 = pd.Series([1,2,5,4],index = ['USA', 'Germany','Italy', 'Japan'])

In [ ]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [ ]:
ser1['USA']

Operations are then also done based off of index:

In [ ]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

Let's stop here for now and move on to DataFrames, which will expand on the concept of Series!

# DataFrames

DataFrames are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [ ]:
np.random.seed(97)

In [ ]:
df = pd.DataFrame(np.random.randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [ ]:
df

          W         X         Y         Z
A -1.751188 -0.429598 -0.746389  1.006848
B -0.591124 -1.127329 -0.681932 -0.975061
C  0.675444 -0.257598 -0.289145 -0.345207
D -1.685099 -0.719904  0.382939 -0.524336
E  1.624821  1.425709  1.202189  0.832470

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [ ]:
df['W']

A   -1.751188
B   -0.591124
C    0.675444
D   -1.685099
E    1.624821
Name: W, dtype: float64

In [ ]:
# Pass a list of column names
df[['W','Z']]

          W         Z
A -1.751188  1.006848
B -0.591124 -0.975061
C  0.675444 -0.345207
D -1.685099 -0.524336
E  1.624821  0.832470

In [ ]:
# SQL Syntax (NOT RECOMMENDED!)
df.W

A   -1.751188
B   -0.591124
C    0.675444
D   -1.685099
E    1.624821
Name: W, dtype: float64

DataFrame Columns are just Series

In [ ]:
type(df['W'])

pandas.core.series.Series

**Creating a new column:**

In [ ]:
df['new'] = df['W'] + df['Y']

In [ ]:
df

          W         X         Y         Z       new
A -1.751188 -0.429598 -0.746389  1.006848 -2.497577
B -0.591124 -1.127329 -0.681932 -0.975061 -1.273056
C  0.675444 -0.257598 -0.289145 -0.345207  0.386299
D -1.685099 -0.719904  0.382939 -0.524336 -1.302160
E  1.624821  1.425709  1.202189  0.832470  2.827010

**Removing Columns**

In [ ]:
df.drop('new',axis=1)

          W         X         Y         Z
A -1.751188 -0.429598 -0.746389  1.006848
B -0.591124 -1.127329 -0.681932 -0.975061
C  0.675444 -0.257598 -0.289145 -0.345207
D -1.685099 -0.719904  0.382939 -0.524336
E  1.624821  1.425709  1.202189  0.832470

In [ ]:
# Not inplace unless specified!
df

          W         X         Y         Z       new
A -1.751188 -0.429598 -0.746389  1.006848 -2.497577
B -0.591124 -1.127329 -0.681932 -0.975061 -1.273056
C  0.675444 -0.257598 -0.289145 -0.345207  0.386299
D -1.685099 -0.719904  0.382939 -0.524336 -1.302160
E  1.624821  1.425709  1.202189  0.832470  2.827010

In [ ]:
df.drop('new',axis=1,inplace=True)

In [ ]:
df

          W         X         Y         Z
A -1.751188 -0.429598 -0.746389  1.006848
B -0.591124 -1.127329 -0.681932 -0.975061
C  0.675444 -0.257598 -0.289145 -0.345207
D -1.685099 -0.719904  0.382939 -0.524336
E  1.624821  1.425709  1.202189  0.832470

Can also drop rows this way:

In [ ]:
df.drop('E',axis=0)

          W         X         Y         Z
A -1.751188 -0.429598 -0.746389  1.006848
B -0.591124 -1.127329 -0.681932 -0.975061
C  0.675444 -0.257598 -0.289145 -0.345207
D -1.685099 -0.719904  0.382939 -0.524336

**Selecting Rows**

In [ ]:
df.loc['A']

W   -1.751188
X   -0.429598
Y   -0.746389
Z    1.006848
Name: A, dtype: float64

Or select based off of position instead of label

In [ ]:
df.iloc[2]

W    0.675444
X   -0.257598
Y   -0.289145
Z   -0.345207
Name: C, dtype: float64

**Selecting subset of rows and columns **

In [ ]:
df.loc['B','Y']

-0.681932024598197

In [ ]:
df.loc[['A','B'],['W','Y']]

          W         Y
A -1.751188 -0.746389
B -0.591124 -0.681932

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [ ]:
df

          W         X         Y         Z
A -1.751188 -0.429598 -0.746389  1.006848
B -0.591124 -1.127329 -0.681932 -0.975061
C  0.675444 -0.257598 -0.289145 -0.345207
D -1.685099 -0.719904  0.382939 -0.524336
E  1.624821  1.425709  1.202189  0.832470

In [ ]:
df>0

       W      X      Y      Z
A  False  False  False   True
B  False  False  False  False
C   True  False  False  False
D  False  False   True  False
E   True   True   True   True

In [ ]:
df[df>0]

          W         X         Y         Z
A       NaN       NaN       NaN  1.006848
B       NaN       NaN       NaN       NaN
C  0.675444       NaN       NaN       NaN
D       NaN       NaN  0.382939       NaN
E  1.624821  1.425709  1.202189  0.832470

In [ ]:
df[df['W']>0]

          W         X         Y         Z
C  0.675444 -0.257598 -0.289145 -0.345207
E  1.624821  1.425709  1.202189  0.832470

In [ ]:
df[df['W']>0]['Y']

C   -0.289145
E    1.202189
Name: Y, dtype: float64

In [ ]:
df[df['W']>0][['Y','X']]

          Y         X
C -0.289145 -0.257598
E  1.202189  1.425709

For two conditions you can use | and & with parenthesis:

In [ ]:
df[(df['W']>0) & (df['Y'] > 1)]

          W         X         Y        Z
E  1.624821  1.425709  1.202189  0.83247

# Missing Data

Let's show a few convenient methods to deal with Missing Data in pandas:

In [ ]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [ ]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [ ]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [ ]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [ ]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [ ]:
df.fillna(value='hi')

    A   B  C
0   1   5  1
1   2  hi  2
2  hi  hi  3

In [ ]:
df['A'] = df['A'].fillna(value=df['A'].mean())

In [ ]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  1.5  NaN  3

# Groupby

The groupby method allows you to group rows of data together and call aggregate functions

In [ ]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [ ]:
df = pd.DataFrame(data)

In [ ]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

Now you can use the .groupby() method to group rows together based off of a column name. For instance let's group based off of Company. This will create a DataFrameGroupBy object:

In [ ]:
df.groupby('Company')

You can save this object as a new variable:

In [ ]:
by_comp = df.groupby("Company")

And then call aggregate methods off the object:

In [ ]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [ ]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

More examples of aggregate methods:

In [ ]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [ ]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [ ]:
by_comp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [ ]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [ ]:
by_comp.describe()

                    Sales
Company
FB      count    2.000000
        mean   296.500000
        std     75.660426
        min    243.000000
        25%    269.750000
        50%    296.500000
        75%    323.250000
        max    350.000000
GOOG    count    2.000000
        mean   160.000000
        std     56.568542
        min    120.000000
        25%    140.000000
        50%    160.000000
        75%    180.000000
        max    200.000000
MSFT    count    2.000000
        mean   232.000000
        std    152.735065
        min    124.000000
        25%    178.000000
        50%    232.000000
        75%    286.000000
        max    340.000000

In [ ]:
by_comp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [ ]:
by_comp.describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

# Operations

There are lots of operations with pandas that will be really useful to you, but don't fall into any distinct category. Let's show them here in this lecture:

In [ ]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### Info on Unique Values

In [ ]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [ ]:
df['col2'].nunique()

3

In [ ]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

### Selecting Data

In [ ]:
#Select from DataFrame using criteria from multiple columns
newdf = df[(df['col1']>2) & (df['col2']==444)]

In [ ]:
newdf

   col1  col2 col3
3     4   444  xyz

### Applying Functions

In [ ]:
def times2(x):
    return x*2

In [ ]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [ ]:
df['new'] = df['col1'].apply(times2)

In [ ]:
df

   col1  col2 col3  new
0     1   444  abc    2
1     2   555  def    4
2     3   666  ghi    6
3     4   444  xyz    8

In [ ]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [ ]:
df['col1'].sum()

10

**Permanently Removing a Column**

In [ ]:
del df['col1']

In [ ]:
df

   col2 col3  new
0   444  abc    2
1   555  def    4
2   666  ghi    6
3   444  xyz    8

**Get column and index names:**

In [ ]:
df.columns

Index(['col2', 'col3', 'new'], dtype='object')

In [ ]:
df.index

RangeIndex(start=0, stop=4, step=1)

**Sorting and Ordering a DataFrame:**

In [ ]:
df

   col2 col3  new
0   444  abc    2
1   555  def    4
2   666  ghi    6
3   444  xyz    8

In [ ]:
df.sort_values(by='col2')

   col2 col3  new
0   444  abc    2
3   444  xyz    8
1   555  def    4
2   666  ghi    6

**Find Null Values or Check for Null Values**

In [ ]:
df.isnull()

    col2   col3    new
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [ ]:
# Drop rows with NaN Values
df.dropna()

   col2 col3  new
0   444  abc    2
1   555  def    4
2   666  ghi    6
3   444  xyz    8

# Data Input and Output

This notebook is the reference code for getting input and output, pandas can read a variety of file types using its pd.read_ methods. Let's take a look at the most common data types:

## CSV

### CSV Input

In [ ]:
df = pd.read_csv('example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

### CSV Output

In [ ]:
df.to_csv('example',index=False)

## Excel
Pandas can read and write excel files, keep in mind, this only imports data. Not formulas or images, having images or macros may cause this read_excel method to crash.

### Excel Input

In [ ]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

### Excel Output

In [ ]:
df.to_excel('Excel_Sample.xlsx',sheet_name='Sheet1')